Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: ཤིན་ཏུ་ངོ་མཚར་འོད་དང་སྟོབས་མཆོག་མཚུངས་མེད་སྟོབས། །གསུང་ནི་སྐྱོན་བྲལ་འཁྲུལ་པ་མི་མངའ་དགྲ་འདུལ་བ། །རྡུལ་མེད་རབ་རིབ་བདག་གི་མུན་པ་ཤིན་ཏུ་བཅོམ། །
en: “Your light is extraordinary, your power is supreme and peerless, Your faultless and undeluded speech tames all enemies, You clear away the darkness of our blurred vision and cause it to become spotless;

source: དགྲ་བྲལ་ཕན་མཛད་ཁྱེད་ཀྱི་དུས་ལགས་འདིར་གཤེགས་གསོལ། །
en: Benefactor free from enemies, it is time for you to arrive here!

source: སྦྱིན་དང་དུལ་དང་ལེགས་སྤྱོད་མི་མཉམ་མཚུངས་དང་མཉམ། །
en: “Your generosity, composure, and excellent conduct are unequaled;

source: ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་མི་འཁྲུགས་བརྟུལ་ཞུགས་དཀའ་ཐུབ་དགྱེས། །
en: Your practice of discipline is unshakeable—you delight in discipline and austerities.

source: བཟོད་དང་དུལ་དང་ཤིན་ཏུ་དགེ་ལ་ངེས་པའི་ཐུགས། །
en: Your mind has embraced patience, composure, and virtue, And

source: དགའ་གསུང་དགྲ་རྣམས་ཀྱི་ནི་དགའ་སྤོང་གཤེགས་སུ་གསོལ། །
en: your cheerful words eliminate the joy of your enemies; we supplicate you to arrive!

source: དབང་པོ་སྟོབས་དང་ལམ་དགྱེས་བསམ་གཏན་མངོན་མཁྱེན་རོལ། །
en: “You enjoy the powers, strengths, and path, and revel in concentrations and higher perceptions.

source: དྲན་དང་བློ་གྲོས་རྟོགས་དང་མོས་ལ་གནས་པའི་ཐུགས། །
en: Your mind is firmly established in mindfulness, wisdom, realization, and resolution.

source: འོད་ནི་རབ་ཏུ་ལྷག་གེ་ཤིན་ཏུ་དགྱེས་པའི་ཐུགས། །
en: Your mind is delighted and you shine with the brightest light.

source: ཡོན་ཏན་མངའ་བ་ཁྱོད་འདིར་གཤེགས་པའི་དུས་འདི་ལགས། །
en: You who possess such excellent qualities; it is time for you to arrive!

source: བྱམས་དང་སྙིང་རྗེ་དགའ་དང་བཏང་སྙོམས་བསྒོམས་པའི་ཐུགས། །སྐྱོན་གྱི་མུན་པ་བཅོམ་ཞིང་བག་ལ་ཉལ་དང་བྲལ། །
en: “You have mastered love, compassion, joy, and equanimity, Overcome the darkness of faults, and eliminated all latent tendencies.

source: ཚངས་པའི་ལམ་ནི་རབ་བསླབས་རྒྱལ་བའི་ལམ་ལ་གནས། །
en: You are trained in the path of purity and you dwell on the path of the victorious ones;

source: དགའ་མཛད་བདེ་བར་གཤེགས་པ་དུས་ལགས་གཤེགས་སུ་གསོལ། །
en: Blissful One who brings joy, it is time for you to arrive!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་དུས་བསྐུལ་བའི་ཚིགས་སུ་བཅད་པ་གསན་ནས་དགེ་སློང་གི་དགེ་འདུན་ལ་བཀའ་སྩལ་པ།
en: When the Blessed One heard the kiṃnara king Druma’s verses announcing that it was mealtime, he said to his saṅgha of monks,

source: དགེ་སློང་དག་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་དུས་བསྐུལ་གྱིས་ལྷུང་བཟེད་དང་། ཆོས་གོས་ཐོགས་ལ་ཞག་བདུན་གནས་པའི་གཙུག་ལག་ཁང་སྐྱོང་ཡང་སྐོས་ཤིག །
en: “Monks, the kiṃnara king Druma has requested us to come. So, take your alms bowls and your Dharma robes, and appoint a caretaker to stay in the temple for seven days.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་འདི་སྙམ་དུ་སེམས་ཏེ།
en: At this moment, the bodhisattva Divyamauli formed the resolve,

source: འདི་ལྟར་བདག་གིས་ཁང་པ་བརྩེགས་པ། བཀོད་པ་འདི་ལྟ་བུ་སྤྲུལ་ལ་ཁང་པ་བརྩེགས་པ་དེར། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དང་ཉན་ཐོས་ཀྱི་ཚོགས་དང་བཅས་པ་བཞུགས་ཏེ།
en: “I will emanate a mansion in which the Blessed One and his assemblies of bodhisattvas and hearers can reside.

source: རིན་པོ་ཆེ་བཀོད་པའི་སེང་གེའི་ཁྲི་ལ་བཞུགས་པའི་ཁང་པ་བརྩེགས་པ་བདག་གིས་ལག་པ་གཡས་པར་བླངས་ཏེ། ནམ་མཁའི་ངོས་ལས་རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ལྡང་དུ་བཀུར་བར་བྱིན་གྱིས་བརླབ་བོ་སྙམ་མོ། །
en: I can then lift up this storied mansion, which contains bejeweled lion thrones, with my right hand and carry it through the sky to the majestic Mount Gandhamādana!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་དེའི་ཚེ་འདི་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: In that instant, the bodhisattva Divyamauli entered into a state of absorption.

source: ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཁང་པ་བརྩེགས་པ་ཚད་དཔག་ཚད་བཅུ་པ་བཀྲ་བ་བལྟ་ན་སྡུག་པ། གྲུ་བཞི་པ། ཀ་བ་བཞི་ཟུག་པ། ཆ་མཉམ་པ། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་བྱུང་ངོ་། །
en: As soon as he had entered this absorption, a beautiful and magnificent storied mansion appeared in front of the Blessed One. It measured ten leagues, and it was square, built with four pillars, perfectly proportioned, and symmetrical.

source: ཁང་པ་བརྩེགས་པ་དེར་སྟོབས་དང་ལྡན་པའི་པད་མ་བཀོད་པའི་ཁྲི་རྣམས་ཀྱང་བྱུང་ངོ་། །
en: Inside the mansion, seats made of majestic lotus flowers were arranged.

source: ཁང་པ་བརྩེགས་པ་དེར་བཅོམ་ལྡན་འདས་ཀྱི་གདན་རིན་པོ་ཆེའི་པད་མ་བཀོད་པའི་སེང་གེའི་ཁྲི་འཕང་དུ་མི་བདུན་ཡོད་པ་བྱུང་ངོ་། །
en: The mansion also had a lion throne for the Blessed One, made of precious lotuses and the height of seven men.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱིས་ཁང་པ་བརྩེགས་པ་བཀོད་པ་དང་། སེང་གེའི་ཁྲི་བཀོད་པ་འདི་ལྟ་བུ་འདི་བྱས་ནས།
en: When the bodhisattva Divyamauli had manifested this storied mansion and the lion throne,

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: he said to the Blessed One,

source: བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དང་ཉན་ཐོས་ཆེན་པོ་འདི་དག་དང་ཐབས་ཅིག་ཏུ་ཁང་པ་བརྩེགས་པ་སེང་གེའི་ཁྲི་བཤམས་པ་འདིར་བཞུགས་སུ་གསོལ།
en: “Blessed One, out of love for me, please take your place in this storied mansion with these bodhisattvas and great hearers, and sit on this lion throne that I have manifested.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཁང་པ་བརྩེགས་པ་འདི་སུག་པ་གཡས་པས་བླངས་ཏེ། རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ལྡང་དུ་འཚལ་ནས་གཞག་པར་བགྱིའོ། །
en: Blessed One, I will then take this storied mansion in my right hand and transport it to the majestic Mount Gandhamādana.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དང་ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་ཐབས་ཅིག་ཏུ་ཁང་པ་བརྩེགས་པ་དེར་ཇི་ལྟར་ཁྲི་བཤམས་པ་དེ་དག་ལ་བཞུགས་སོ། །
en: Out of love for the bodhisattva Divyamauli, the Blessed One entered the storied mansion with those bodhisattvas and great hearers, and they all sat on the thrones that had been arranged for them.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱིས་ཁང་པ་བརྩེགས་པ་དེ་ལག་མཐིལ་གཡས་པར་བླངས་ཏེ། སྟེང་གི་ནམ་མཁའ་ལས་རྫུ་འཕྲུལ་གྱིས་སོང་ངོ་། །
en: The bodhisattva Divyamauli then placed the storied mansion in the palm of his right hand and carried it through the sky by means of his miraculous powers .

source: དེ་ནས་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་འདི་མཐོང་ནས་
en: When the gods of the desire realm and the gods of the form realm saw the miraculous display of the bodhisattva Divyamauli,

source: དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་
en: Once joy and happiness had filled their minds,

source: བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷའི་ཅོད་པན་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་ཐམས་ཅད་ཐོགས་ཏེསིལ་སྙན་དང་ཕེག་རྡོབ་པ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཁང་པ་བརྩེགས་པ་ན་བཞུགས་ཤིང་། ནམ་མཁའི་ངོས་ལས་གཤེགས་པ་ལ་མཆོད་པ་བྱས་ཏེ།
en: as an act of worship for the Blessed One and the bodhisattva great being Divyamauli, they carried flowers, incense, perfumes, garlands, and ointments, played instruments and drums, and venerated the Blessed One, who resided in the storied mansion as it traversed the sky.

source: རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ལྡང་དུ་ཕྱིན་ཏོ། །
en: When they arrived at the majestic Mount Gandhamādana,

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་བཅོམ་ལྡན་འདས་ཁང་པ་བརྩེགས་པ་ན་བཞུགས་ཤིང་ནམ་མཁའི་ངོས་ལས་གཤེགས་པ་མཐོང་ངོ་། །
en: the kiṃnara king Druma saw the Blessed One residing in the storied mansion as it approached in the sky.

source: མཐོང་ནས་མིའམ་ཅི་དང་། དྲི་ཟ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་བསྐོར་ཏེ།
en: Surrounded by eighty-four thousand kiṃnaras and gandharvas,

source: མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་ཐམས་ཅད་ཐོགས་ནས་སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་གླུ་དབྱངས་ལེན་པའི་བཀོད་པ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་བསུ་བའི་ཕྱིར་བྱུང་ངོ་། །
en: he came to welcome the Blessed One carrying flowers, incense, perfumes, garlands, and ointments, playing instruments and drums, and singing songs.

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་དཔུང་དང་བཅས་འཁོར་དང་བཅས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཇི་ལྟར་ཐོགས་པའི་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དེ་དག་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། གླུ་དབྱངས་ལེན་པས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་སོ། །
en: Then, with his subjects and retinues, the kiṃnara king Druma prostrated to the feet of the Blessed One and offered him the flowers, incense, perfumes, garlands, and ointments they were carrying, while playing instruments and drums and singing songs.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དུས་ལ་བབ་པར་མཁྱེན་ནས། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། དེ་མ་ཡིན་པ་གཞན་ལྷའི་བུ་རྣམས་དང་། ཐབས་ཅིག་ཏུ་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་འཁོར་གྱི་ཁྱམས་བཀོད་པ་ག་ལ་བ་དེར་གཤེགས་ཏེ་
en: Knowing that the time had come, the Blessed One then proceeded, together with the bodhisattvas, the great hearers, Śakra, Brahmā, the protectors of the world, and the other gods, to the courtyard that had been arranged by the kiṃnara king Druma,

source: རང་གི་སེང་གེའི་ཁྲི་ཇི་ལྟར་བཤམས་པ་ལ་བཞུགས་སོ། །
en: where he sat on the lion throne that had been prepared for him.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་ཉན་ཐོས་ཀྱི་ཚོགས་ཐམས་ཅད་སོ་སོ་ཅི་རིགས་པར་འཁོད་དོ། །
en: All the groups of bodhisattvas and hearers also sat down on their respective seats.

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་ལ་སྨྲས་པ།
en: The kiṃnara king Druma said to Śakra, Brahmā, the protectors of the world, the gods of the desire realm, and the gods of the form realm,

source: གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པ་དང་ཐབས་ཅིག་ཏུ་གདུགས་ཚོད་གསོལ་གྱིས།
en: “My friends, please join the Thus-Gone One for the midday meal.

source: ཁྱེད་ཐམས་ཅད་འདུས་ལ་ཚུར་སྤྱོན།
en: All of you, come here!”

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་སླས་དང་བཅས། བུ་དང་བཅས། རང་གི་སྐྱེ་བོ་དང་བཅས། འཁོར་དང་བཅས། གཡོག་དང་བཅས་ཏེ་རང་རང་གི་ལག་གིས་བཟའ་བ་དང་། བཅའ་བ་གྱ་ནོམ་པ་མང་པོ་རོ་དང་ལྡན་པ། རོ་བརྒྱ་པའི་ཞལ་ཟས་སྣ་ཚོགས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་། དགེ་སློང་གི་དགེ་འདུན་དང་། འཁོར་ལ་བྲིམས་ནས་
en: Then, the kiṃnara king Druma and his queens, children, subjects, retinues, and servants personally offered a rich feast of the most delicious and flavorful foods and beverages to the Blessed One, his saṅgha of bodhisattvas, his saṅgha of monks, and the rest of the assembly;

source: བདེ་བར་བསྟབས་ཏེ་ཚིམ་པར་བྱས་སོ། །
en: they fed them to their full satisfaction.

source: ཚིམ་པར་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷུང་བཟེད་བཞག་སྟེ།
en: After they were satiated, the Blessed One put his alms bowl aside and washed his hands.

source: ཕྱག་བཅབས་པར་རིག་ནས། དཔུང་དང་བཅས་གཡོག་དང་བཅས་ཏེ། ཆོས་ཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཇི་ལྟར་བདག་ལ་འོས་པའི་སྟན་ལ་འདུག་གོ། །
en: When they saw this, the king, the subjects, and the servants all sat down in front of the Blessed One to listen to the Dharma, each on their respective seats.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་དང་སྐྱེ་བོའི་ཚོགས་ཕལ་པོ་ཆེ་དེ་དག་ལ་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་སྟོན་ཏོ། །
en: The Blessed One then gave a Dharma discourse to the kiṃnara king Druma and the whole assembly.

source: ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ། །
en: It captivated, [inspired, and delighted ]them.

source: གཟེངས་བསྟོད་དོ། །
en: It [captivated, ]inspired, [and delighted ]them.

source: རབ་ཏུ་དགའ་བར་མཛད་དོ། །
en: It [captivated, inspired, and ]delighted them.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་གཏམ་ནི་འདི་ཡིན་ཏེ།
en: This is the Dharma discourse that he gave:

source: མིའམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: “Lord of the kiṃnaras, there are thirty-two ways in which the bodhisattva great beings’ perfection of generosity is pure.

source: རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་གང་འདི་ལྟ་སྟེ། མིའམ་ཅིའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་སྦྱིན་པ་ན་བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་དུ་འགྲོ་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: What are those thirty-two? Lord of the kiṃnaras, they are as follows: (1) Bodhisattvas practice generosity after giving rise to the mind set on awakening.

source: ཐེག་པ་ཆུང་ངུ་སྤངས་པའི་སེམས་ཀྱིས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་། སློང་བ་ལ་ཞེ་སྡང་བ་མེད་པའི་སེམས་ཀྱིས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (2) They practice generosity with an attitude of having abandoned the Lower Vehicle. (3) They practice generosity with an attitude free from aversion to being asked.

source: ལེན་པ་རྣམས་ལ་སྦྱིན་གནས་སུ་འདུ་ཤེས་བསྐྱེད་དེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་། ལེན་པ་རྣམས་ལ་དགེ་བའི་བཤེས་གཉེན་དུ་འདུ་ཤེས་བསྐྱེད་དེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (4) They practice generosity while perceiving the recipients of their gifts as worthy of their generosity. (5) They practice generosity while perceiving the recipients of their gifts as virtuous friends.

source: ནང་གི་ཀུན་ནས་ཉོན་མོངས་པའི་དྲི་མ་སྤངས་ཏེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (6) They practice generosity after having abandoned the stains of inner afflictions.

source: ཀུན་ཏུ་འཛིན་པ་མེད་པའི་སེམས་ཀྱི་དགའ་བ་དང་། དང་བ་དང་མཆོག་ཏུ་དགའ་བ་ཐོབ་ནས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (7) They practice generosity with a joyful attitude that is free from grasping but endowed with faith and delight.

source: ལག་པ་བརྐྱང་སྟེ་གྲོལ་བས་གཏོང་བ་རྣམ་པར་གཏོང་བ་ལ་དགའ་བས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (8) They practice generosity by delighting in open-handed munificence.

source: རྒྱ་ཆེན་པོ་ལ་མོས་ཏེ་ཞུམ་པ་མེད་པའི་སེམས་ཀྱིས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་། སྣོད་ཐམས་ཅད་ལ་མི་གནས་པར་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (9) They practice generosity with an attitude that is drawn to the vast approach and never becomes discouraged. (10) They practice generosity without fixating on any recipient.

source: རྣམ་པར་སྨིན་པ་ལ་རེ་བ་མེད་པར་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་། ལན་ལ་རེ་བ་མེད་པའི་བློས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཚོལ་བའི་བློས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (11) They practice generosity without hoping for karmic ripening. (12) They practice generosity without hoping for reward. (13) They practice generosity with an attitude that pursues the buddha qualities.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་བསྔོས་ཏེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (14) They practice generosity and dedicate it to omniscient wisdom.

source: གདུང་བ་མེད་པའི་སེམས་ཀྱིས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་། བསྡུ་བའི་དངོས་པོ་སྔོན་དུ་འགྲོ་བས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (15) They practice generosity with an attitude that is not troubled. (16) They practice generosity while being guided by the means of attracting disciples. (17) They practice generosity in order to ripen sentient beings.

source: ཆོས་འཛིན་པར་གྱུར་ཅིག་སྙམ་སྟེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གསུང་དང་འཐུན་པར་གྱུར་ཅིག་སྙམ་སྟེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (18) They practice generosity while thinking, ‘May I uphold the Dharma.’ (19) They practice generosity while thinking, ‘May I act in harmony with the words of the thus-gone ones.’

source: བདག་བདུད་ཀྱི་ཕྱོགས་ཚར་གཅོད་པར་གྱུར་ཅིག་ཅེས་ཏེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (20) They practice generosity while thinking, ‘May I annihilate the armies of Māra.’

source: བདག་བྱང་ཆུབ་ཀྱི་ལམ་རྣམ་པར་སྤྱོད་པར་གྱུར་ཅིག་ཅེས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (21) They practice generosity while thinking, ‘May I traverse the path of awakening.’

source: བདག་སྐྱེས་བུ་དམ་པའི་ལས་བྱེད་པར་གྱུར་ཅིག་ཅེས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (22) They practice generosity while thinking, ‘May I engage in the actions of a sublime being.’

source: བདག་ཡི་དགས་ཀྱི་ལམ་རྣམ་པར་སྤོང་བར་གྱུར་ཅིག་ཅེས་ཏེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (23) They practice generosity while thinking, ‘May I abandon the path of the pretas.’

source: བདག་གི་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་རྒྱུར་གྱུར་ཅིག་ཅེས་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (24) They practice generosity while thinking, ‘May this be the cause for me to give away all my possessions.’

source: བདག་གིས་ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་བའི་བསྒྲུབ་པ་རབ་ཏུ་བཟུང་བར་གྱུར་ཅིག་ཅེས་ཏེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (25) They practice generosity while thinking, ‘May I embrace the accomplishment of having great wealth.’

source: ཆོས་ལ་དགའ་བར་རབ་ཏུ་གནས་པར་གྱུར་ཅིག་ཅེས་ཏེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (26) They practice generosity while thinking, ‘May I abide with joy in the Dharma.’

source: བདག་ལ་དགེ་བའི་བཤེས་གཉེན་དཀོན་པར་མ་གྱུར་ཅིག་ཅེས་ཏེ་སྦྱིན་པ་དེ་སྦྱིན་པ་དང་།
en: (27) They practice generosity while thinking, ‘May it not be rare for me to meet virtuous friends.’

source: !བདག་ལ་སེམས་ཅན་ཐམས་ཅད་དགའ་བའི་མིག་དང་ལྡན་པར་གྱུར་ཅིག་ཅེས་ཏེ་སྦྱིན་པ་སྦྱིན་པ་དང་།
en: (28) They practice generosity while thinking, ‘May I develop the eye which is devoid of hostility toward all beings.’

source: བདག་གི་སྦྱིན་པ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་པར་གྱུར་ཅིག་ཅེས་སྦྱིན་པ་སྦྱིན་པ་དང་།
en: (29) They practice generosity while thinking, ‘Through this generosity, may I achieve unsurpassed and perfect awakening.’

source: བྱང་ཆུབ་སེམས་དཔའ་གཏོང་བ་ཕུན་སུམ་ཚོགས་པ་གཞན་རྣམས་ཀྱི་རྗེས་སུ་སློབ་པར་མ་གྱུར་ཅིག་ཅེས་ཏེ་སྦྱིན་པ་སྦྱིན་པ་དང་།
en: (30) They practice generosity while thinking, ‘May I train in the excellent generosity of the other bodhisattvas.’

source: བདག་མཚན་དང་དཔེ་བྱད་བཟང་པོ་བསགས་པ་ཡོངས་སུ་འཛིན་པར་གྱུར་ཅིག་ཅེས་ཏེ་སྦྱིན་པ་སྦྱིན་པ་དང་།
en: (31) They practice generosity while thinking, ‘May I acquire the collection of the excellent major and minor marks.’

source: བདག་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་བ་དང་། བདག་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་གྱུར་ཅིག་ཅེས་ཏེ་སྦྱིན་པ་སྦྱིན་པ་སྟེ།
en: (32) They practice generosity while thinking, ‘May I purify the buddha realms and actualize all buddha qualities.’

source: མི་འམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་གིས། བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: Lord of the kiṃnaras, those are the thirty-two ways in which the bodhisattvas’ perfection of generosity is pure.

source: མི་འམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: “Lord of the kiṃnaras, there are thirty-two ways in which the bodhisattva great beings’ perfection of discipline is pure.

source: སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན།
en: What are those thirty-two ways?

source: འདི་ལྟ་སྟེ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་བྲལ་བས་ལུས་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་དང་། བདག་གི་ལྷ་སངས་རྒྱས་ལ་མི་སླུ་བའི་མཚན་ཉིད་ཀྱིས་ངག་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་དང་། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་མེད་པས་སེམས་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་དང་། ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་མྱོང་བས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་དང་།
en: They are as follows: (1) They are free from desire, anger, and ignorance, and therefore adhere to a pure physical discipline. (2) They have a nature that never wishes to disappoint their lord, the Buddha, and so they adhere to a pure verbal discipline. (3) They are devoid of covetousness, ill will, and wrong views, and therefore adhere to a pure mental discipline. (4) They experience the excellence of gods and humans and therefore adhere to the pure discipline of the path of the ten virtuous actions.

source: ཉི་ཚེ་བའི་ས་ཐམས་ཅད་མི་སྟོན་པས་བྱང་ཆུབ་ཀྱི་སེམས་དང་། བསམ་པ་མི་བརྗེད་པའི་ཚུལ་ཁྲིམས་དང་།
en: (5) They do not teach any limited levels and therefore adhere to the discipline of the mind of awakening and the discipline consisting in not forgetting that attitude.

source: ཤིན་ཏུ་ཉམས་པ་མེད་ཅིང་གཡོ་དང་བྲལ་བས་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་དང་།
en: (6) They are free from transgression and dishonesty and therefore adhere to the pure discipline of a good motivation.

source: སྐྱེ་བོ་ཕལ་པ་ཐམས་ཅད་སྡུད་པས་འཕགས་པའི་སྐྱེ་བོས་བསྔགས་པའི་ཚུལ་ཁྲིམས་དང་།
en: (7) They attract all ordinary beings and therefore adhere to a discipline that is praised by noble beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པར་བྱམས་པ་སྔོན་དུ་འགྲོ་བའི་ཚུལ་ཁྲིམས་དང་།
en: (8) They adhere to a discipline supported by love by being equally directed toward all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པས་སྙིང་རྗེ་ཆེན་པོ་ལ་རབ་ཏུ་སྦྱོར་བའི་ཚུལ་ཁྲིམས་དང་།
en: (9) They protect all beings and therefore adhere to a discipline that embraces great compassion.

source: !དམ་བཅས་པའི་སྟོབས་ཀྱིས་བསླབ་པ་རྫོགས་པ་མེད་པ་ཡང་དག་པར་འཛིན་པའི་ཚུལ་ཁྲིམས་དང་།
en: (10) Due to the power of their commitments, they adhere to a discipline that perfectly upholds their training.

source: ཁ་ན་མ་ཐོ་བ་ཆུང་ངུ་ལ་ཡང་འཇིགས་པར་ལྟ་བས་ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ་ཕུན་སུམ་ཚོགས་པའི་ཚུལ་ཁྲིམས་དང་།
en: (11) They shun even the smallest unwholesome actions and therefore adhere to a discipline of genuine humility and modesty.

source: ཤིན་ཏུ་མི་གཏོང་བས་སྐྱོན་མེད་པའི་ཚུལ་ཁྲིམས་དང་།
en: (12) They are relentless and therefore adhere to a faultless discipline.

source: སྤྱོད་པ་ཤིན་ཏུ་དག་པས་ཐུན་ཚགས་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་དང་།
en: (13) Their conduct is utterly pure and so they adhere to a spotless discipline.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དུ་འགྲོ་བས་རང་གི་རྣམ་པ་མང་པོ་ལ་དབང་བྱེད་པའི་ཚུལ་ཁྲིམས་དང་།
en: (14) They travel to other buddha realms and therefore adhere to a discipline of mastering many personal attributes.

source: སྐྱེ་བོ་མཁས་པས་རིག་པའི་ཕྱིར་སྔགས་པའི་ཚུལ་ཁྲིམས་དང་།
en: (15) They are known by wise beings and therefore adhere to a discipline that is praised.

source: ངན་སོང་ངན་འགྲོ་ཐམས་ཅད་ཀྱི་ལམ་ལས་སྒྲོལ་བའི་ཚུལ་ཁྲིམས་དང་།
en: (16) They adhere to a discipline that liberates from all the paths leading to the lower realms.

source: བདེ་བའི་དངོས་པོ་ཐམས་ཅད་ལ་རབ་ཏུ་གནས་པའི་ཚུལ་ཁྲིམས་དང་།
en: (17) They adhere to a discipline that is grounded in all the sources of happiness.

source: སངས་རྒྱས་ཀྱི་ཚུལ་ཁྲིམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས་སངས་རྒྱས་ཀྱིས་གནང་བའི་ཚུལ་ཁྲིམས་དང་།
en: (18) They perfect the discipline of the buddhas and therefore adhere to a discipline that is approved by the buddhas.

source: ཡི་དམ་ལ་བརྟན་པས་མི་ལྷོད་པའི་ཚུལ་ཁྲིམས་དང་།
en: (19) They maintain their commitments firmly and therefore adhere to a discipline that is not lax.

source: རང་གི་སེམས་ངེས་པར་སེམས་པས་བདག་ལ་མི་སྟོད་གཞན་ལ་མི་སྨོད་པའི་ཚུལ་ཁྲིམས་དང་།
en: (20) They reflect on their own minds and so they adhere to a discipline that does not praise oneself or criticize others.

source: ཉོན་མོངས་པ་མེད་པས་ངེས་པར་སེམས་པའི་སྙིང་རྗེའི་ཚུལ་ཁྲིམས་དང་།
en: (21) They are devoid of afflictions and therefore adhere to the discipline of compassionate reflection.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་ཉེ་བར་བྱེད་པའི་ཚུལ་ཁྲིམས་དང་། རབ་ཏུ་དགའ་བར་བྱེད་པ་ལ་དགའ་བར་བྱེད་པའི་ཚུལ་ཁྲིམས་དང་།
en: (22) They adhere to a discipline that engages in all the factors of awakening. (23) They adhere to a discipline that takes pleasure in bringing joy to others.

source: འདོད་པ་དང་། ཆགས་པ་མེད་པས་ཆོག་ཤེས་པར་བྱེད་པའི་ཚུལ་ཁྲིམས་དང་། ནན་ཏན་སྙིང་པོར་བྱེད་པས་བསྒྲུབ་པ་རླབས་པོ་ཆེའི་ཚུལ་ཁྲིམས་དང་།
en: (24) They are devoid of desire and attachment and therefore adhere to a discipline that brings contentment. (25) They act with utmost determination and therefore adhere to a discipline that generates immense accomplishments.

source: ཁྱིམ་གྱི་གནས་ཐམས་ཅད་ལ་མི་ལྟ་བའི་རབ་ཏུ་འབྱུང་བ་ལ་གཞོལ་བའི་ཚུལ་ཁྲིམས་དང་།
en: (26) They have no consideration for the household and therefore adhere to a discipline that is dedicated to the renunciant life.

source: !ཆོས་ཀྱི་དགའ་བ་ལ་དགའ་མོས་པས་དགོན་པ་ལ་དགའ་བ་དང་ལྡན་པའི་ཚུལ་ཁྲིམས་དང་།
en: (27) They are delighted by the pleasure grove of Dharma and therefore adhere to the discipline of enjoying wilderness.

source: འཕགས་པའི་རིགས་ལ་རྟོན་པས་འདོད་པ་ཉུང་ཞིང་ཆོག་ཤེས་པ་ལ་ངེས་པའི་ཚུལ་ཁྲིམས་དང་།
en: (28) They rely on the mainstays of the noble ones and therefore adhere to a discipline that is based on contentment and few desires.

source: སྡིག་པ་འདོད་པ་ཐམས་ཅད་དང་བྲལ་བས་སྦྱངས་པའི་ཡོན་ཏན་ལ་ཡང་དག་པར་རབ་ཏུ་སྦྱོར་བའི་ཚུལ་ཁྲིམས་དང་།
en: (29) They are free from all unwholesome desire and therefore adhere to a discipline that genuinely engages in the ascetic practices.

source: སེམས་ཅན་མེད་པར་རྣམ་པར་སྤྱོད་པས་དམིགས་པ་མེད་པར་སྦྱོར་བའི་ཚུལ་ཁྲིམས་དང་།
en: (30) They experience the nonexistence of beings and therefore adhere to a discipline free from apprehension.

source: ཆད་པ་དང་རྟག་པ་ཡོངས་སུ་སྤོང་བས་ལྟ་བར་སོང་བ་ཐམས་ཅད་དང་གཏི་མུག་སེལ་བའི་ཚུལ་ཁྲིམས་དང་།
en: (31) They have abandoned the views of eternalism and nihilism and therefore adhere to a discipline that eliminates all wrongs views and ignorance.
